#ifndef _IO_NOW_H_
#define _IO_NOW_H_




/*
 *
 * @day 2021_03_16
 *
 *
 * 模块   引脚  功能
驱动  21_4    反转
    21_5    正转
电源  00_12   电源使能
舵机  33_9    舵机信号
OLED    20_10   RST
    20_12   D/C
    20_11   SCK
    20_14   SDI
    15_0    按键6
    15_1    按键5
    15_2    按键4
    15_3    按键3
    15_4    按键2
    15_5    按键1
编码器 10_1    方向
    10_3    步进脉冲
IO口（霍尔入库）   15_6    HAL1
    15_8    HAL2
蜂鸣器 33_8    蜂鸣器信号
蓝牙  14_0    RX
    14_1    TX
电感  A0  L1
    A1  L2
    A2  L3
    A3  L4
    A4  L5
    A5  L6
FLASH(SPI3) 21_2    CS
    21_6    DO
    20_3    DI
    20_0    CLK
摄像头 02_0    VSY
    02_1    PCLK
    02_2    RXD
    02_3    TXD
    00_0    数据
    00_1
    00_2
    00_3
    00_4
    00_5
    00_6
    00_7
IO口（激光入库）   00_8    右激光
    00_9    左激光
 *
 *
 */
















/*
 * @day 2021_03_23
 *
 * 模块   引脚  功能
驱动  21_4    反转
    21_5    正转
电源  00_4    电源使能
舵机  33_9    舵机信号
OLED    20_10   RST
    20_12   D/C
    20_11   SCK
    20_14   SDI
    15_0    按键6
    15_1    按键5
    15_2    按键4
    15_3    按键3
    15_4    按键2
    15_5    按键1

编码器 10_1    方向
    10_3    步进脉冲

IO口（霍尔入库）   15_8    HAL1
    15_7    HAL2
蜂鸣器 33_8    蜂鸣器信号
蓝牙  14_0    RX
    14_1    TX
电感  A13 L1
    A17 L2
    A21 L3
    A24 L4
    A35 L5
    A37 L6
FLASH(SPI3) 21_2    CS
    21_6    DO
    20_3    DI
    20_0    CLK
摄像头 11_3    SDA
    11_2    SCL
    00_7    PIX
    00_9    LINE
    00_8    FRM
    02_0    数据
    02_1
    02_2
    02_3
    02_4
    02_5
    02_6
    02_7
IO口（激光入库）   00_12   右激光
    00_6    左激光
 *
 */



/*
 * @day 2021_03_28
 *

模块  引脚  功能
驱动  21_4    反转
    21_5    正转
电源  00_7    电源使能
舵机  33_9    舵机信号
OLED    20_10   RST
    20_12   D/C
    20_11   SCK
    20_14   SDI
    15_0    按键6
    15_2    按键5
    15_3    按键4
    15_4    按键3
    15_5    按键2
    15_6    按键1
编码器 10_1    方向
    10_3    步进脉冲
IO口（霍尔入库）   15_8    HAL1
    15_7    HAL2
蜂鸣器 33_8    蜂鸣器信号
蓝牙  14_0    RX
    14_1    TX
电感  A13 L1
    A17 L2
    A21 L3
    A24 L4
    A35 L5
    A37 L6
FLASH(SPI3) 21_2    CS
    21_6    DO
    20_3    DI
    20_0    CLK
摄像头 11_3    SDA
    11_2    SCL
    00_4    PIX
    00_9    LINE
    15_1    FRM
    02_0    数据
    02_1
    02_2
    02_3
    02_4
    02_5
    02_6
    02_7
IO口（激光入库）   00_12   右激光
    00_8    左激光
*/









#endif
